perf/root.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    node-timeout:
      target: 'http://localhost:5555/node/timeout'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    node-intensive:
      target: 'http://localhost:5555/node/intensive'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"
    gunicorn-timeout:
      target: 'http://localhost:5555/gunicorn/timeout'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn-timeout"
    gunicorn-intensive:
      target: 'http://localhost:5555/gunicorn/intensive'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn-intensive"
  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 20
      arrivalRate: 5
      rampTo: 400

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'